Benchmark_files/output_cluster_read_t8_2.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)
 
 Running the test with following options:
 Number of threads: 8
 Initializing random number generator from current time
 
 
 Initializing worker threads...
 
 Threads started!
 
 Latency histogram (values are in milliseconds)
        value  ------------- distribution ------------- count
        1.443 |                                         4
        1.469 |*                                        27
        1.496 |**                                       64
        1.523 |***                                      86
        1.551 |***                                      92
        1.579 |**                                       55
        1.608 |*                                        30
        1.637 |                                         13
        1.667 |                                         7
        1.697 |                                         8
        1.728 |                                         3
        1.759 |                                         3
        1.824 |                                         2
        1.960 |                                         2
        1.996 |                                         1
        3.075 |                                         1
        3.130 |                                         3
        3.187 |                                         1
        3.364 |                                         2
        3.425 |                                         1
        3.885 |                                         1
        4.487 |                                         2
        4.652 |                                         4
        4.737 |                                         1
        4.823 |                                         1
        4.910 |                                         1
        4.999 |                                         1
        5.090 |                                         2
        5.470 |                                         2
        5.570 |                                         1
        6.205 |                                         2
        6.318 |                                         4
        6.433 |                                         4
        6.550 |                                         1
        6.669 |                                         1
        6.790 |                                         1
        6.913 |                                         1
        7.039 |                                         1
        7.297 |                                         4
        7.702 |                                         1
        7.842 |                                         9
        7.985 |                                         1
        8.130 |                                         3
        8.277 |                                         2
        8.737 |                                         2
        9.222 |                                         7
        9.389 |                                         5
        9.560 |*                                        14
        9.734 |*                                        15
        9.910 |                                         10
       10.090 |                                         5
       10.274 |                                         7
       10.460 |                                         4
       10.651 |*                                        22
       10.844 |**                                       54
       11.041 |****                                     104
       11.242 |****                                     95
       11.446 |***                                      71
       11.654 |**                                       58
       11.866 |**                                       59
       12.081 |*********                                248
       12.301 |*************************                661
       12.524 |***************************************  1032
       12.752 |**************************************** 1069
       12.984 |************************                 653
       13.219 |*********                                243
       13.460 |****                                     110
       13.704 |****                                     107
       13.953 |*****                                    141
       14.207 |*****                                    128
       14.465 |***                                      80
       14.728 |**                                       60
       14.995 |*                                        20
       15.268 |*                                        21
       15.545 |*                                        25
       15.828 |*                                        23
       16.115 |*                                        22
       16.408 |                                         8
       16.706 |                                         3
       17.010 |                                         7
       17.319 |                                         6
       17.633 |                                         11
       17.954 |                                         3
       18.280 |                                         6
       18.612 |                                         6
       18.950 |                                         9
       19.295 |                                         3
       19.645 |                                         8
       20.002 |                                         8
       20.366 |                                         7
       20.736 |                                         8
       21.112 |*                                        17
       21.496 |*                                        14
       21.886 |*                                        24
       22.284 |*                                        27
       22.689 |**                                       53
       23.101 |***                                      73
       23.521 |****                                     100
       23.948 |***                                      77
       24.384 |**                                       46
       24.827 |*                                        21
       25.278 |                                         12
       25.737 |                                         5
       26.205 |                                         6
       26.681 |                                         5
       27.659 |                                         4
       28.673 |                                         3
       29.194 |                                         1
       30.265 |                                         1
       30.815 |                                         1
  
 SQL statistics:
     queries performed:
         read:                            86996
         write:                           0
         other:                           12428
         total:                           99424
     transactions:                        6214   (620.40 per sec.)
     queries:                             99424  (9926.36 per sec.)
     ignored errors:                      0      (0.00 per sec.)
     reconnects:                          0      (0.00 per sec.)
 
 General statistics:
     total time:                          10.0136s
     total number of events:              6214
 
 Latency (ms):
          min:                                    1.45
          avg:                                   12.87
          max:                                   30.93
          95th percentile:                       23.10
          sum:                                80001.04
 
 Threads fairness:
     events (avg/stddev):           776.7500/1.48
     execution time (avg/stddev):   10.0001/0.01